---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ClassificationNotSetInFamily
source: html/8d4975fa-4175-57d2-515b-e759bf8b10ff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.ClassificationNotSetInFamily Property

A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClassificationNotSetInFamily { get; }
```